This is a file to explore the data sets to:
- set goal of project 
- explore any issues with raw data 
- determine structure of data warehouse or data lake

In [1]:
import pandas as pd 
import numpy as np 

#import Disaster Data 1900 - 2021
pd_d = pd.read_csv('C:\\Users\\msbar\\Data Engineering Final Project\\data\\DISASTERS\\1900_2021_DISASTERS.csv')
pd_d.shape
pd_d.dtypes

Year                            int64
Seq                             int64
Glide                          object
Disaster Group                 object
Disaster Subgroup              object
Disaster Type                  object
Disaster Subtype               object
Disaster Subsubtype            object
Event Name                     object
Country                        object
ISO                            object
Region                         object
Continent                      object
Location                       object
Origin                         object
Associated Dis                 object
Associated Dis2                object
OFDA Response                  object
Appeal                         object
Declaration                    object
Aid Contribution              float64
Dis Mag Value                 float64
Dis Mag Scale                  object
Latitude                       object
Longitude                      object
Local Time                     object
River Basin                    object
Start Year                      int64
Start Month                   float64
Start Day                     float64
End Year                        int64
End Month                     float64
End Day                       float64
Total Deaths                  float64
No Injured                    float64
No Affected                   float64
No Homeless                   float64
Total Affected                float64
Insured Damages ('000 US$)    float64
Total Damages ('000 US$)      float64
CPI                           float64
Adm Level                      object
Admin1 Code                    object
Admin2 Code                    object
Geo Locations                  object
dtype: object

In [8]:
pd_d[pd_d['OFDA Response'].isna() == False].iloc[:,10:25]

,ISO,Region,Continent,Location,Origin,Associated Dis,Associated Dis2,OFDA Response,Appeal,Declaration,Aid Contribution,Dis Mag Value,Dis Mag Scale,Latitude,Longitude
324,CRI,Central America,Americas,Mesata Central,NaN,NaN,NaN,Yes,NaN,NaN,NaN,NaN,NaN,NaN,NaN
336,AZO,Southern Europe,Europe,Sao Jorge Isl.,NaN,NaN,NaN,Yes,NaN,NaN,NaN,5.0,Richter,38.8,-28.4
337,BGD,Southern Asia,Asia,Jessore district,NaN,NaN,NaN,Yes,NaN,NaN,NaN,NaN,Kph,NaN,NaN
338,BGD,Southern Asia,Asia,"Rangpur, Comilla",NaN,NaN,NaN,Yes,NaN,NaN,NaN,NaN,Km2,NaN,NaN
339,BRA,South America,Americas,Bahia state,NaN,NaN,NaN,Yes,NaN,NaN,NaN,NaN,Km2,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15433,PNG,Melanesia,Oceania,"Jiwaka, Morobe, and Simbu provinces",Heavy rains,NaN,NaN,Yes,NaN,NaN,NaN,NaN,Km2,NaN,NaN
15434,GMB,Western Africa,Africa,Kuntaur Local Government,Heavy rains,NaN,NaN,Yes,NaN,NaN,NaN,NaN,Km2,NaN,NaN
15435,SEN,Western Africa,Africa,Northern regions,NaN,Food shortage,NaN,Yes,NaN,NaN,NaN,NaN,Km2,NaN,NaN
15495,LAO,South-Eastern Asia,Asia,"Attapeu, Champasak, Khammouan, Salavan, Savann...",Tropical Storm Podul and Tropical Depression K...,NaN,NaN,Yes,NaN,NaN,NaN,NaN,Km2,NaN,NaN
15530,PRY,South America,Americas,"Alto Paraguay, Amambay, Caazapá, Canindeyú, Co...",Lack of rain—compounded by strong winds and th...,NaN,NaN,Yes,NaN,NaN,NaN,NaN,Km2,NaN,NaN

In [57]:
 #Find percentage of column that is null 
    na = pd_d.isna().sum()
 print(na/pd_d.shape[0])

IndentationError: unexpected indent (<ipython-input-57-5c2fbd9f2c8b>, line 2)

In [58]:
pd_d['Disaster Type'].value_counts()

Flood                    5551
Storm                    4496
Earthquake               1544
Epidemic                 1501
Landslide                 776
Drought                   770
Extreme temperature       603
Wildfire                  471
Volcanic activity         265
Insect infestation         96
Mass movement (dry)        48
Glacial lake outburst       2
Fog                         1
Impact                      1
Animal accident             1
Name: Disaster Type, dtype: int64

In [59]:
# World Surface Temperature data by Country 
pd_temp = pd.read_csv('C:\\Users\\msbar\\Data Engineering Final Project\\data\\GlobalLandTemperaturesByCountry.csv')
pd_d3.shape

(577462, 4)

In [60]:
pd_temp.head()

           dt  AverageTemperature  AverageTemperatureUncertainty Country
0  1743-11-01               4.384                          2.294   Åland
1  1743-12-01                 NaN                            NaN   Åland
2  1744-01-01                 NaN                            NaN   Åland
3  1744-02-01                 NaN                            NaN   Åland
4  1744-03-01                 NaN                            NaN   Åland

In [61]:
pd_temp[pd_temp['dt'] > '1900-01-01']

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
1875,1900-02-01,-8.063,0.657,Åland
1876,1900-03-01,-3.196,0.467,Åland
1877,1900-04-01,0.781,0.224,Åland
1878,1900-05-01,4.960,0.503,Åland
1879,1900-06-01,12.296,1.129,Åland
...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe
577461,2013-09-01,NaN,NaN,Zimbabwe

In [62]:
pd_temp.describe()

       AverageTemperature  AverageTemperatureUncertainty
count       544811.000000                  545550.000000
mean            17.193354                       1.019057
std             10.953966                       1.201930
min            -37.658000                       0.052000
25%             10.025000                       0.323000
50%             20.901000                       0.571000
75%             25.814000                       1.206000
max             38.842000                      15.003000

In [63]:
# World Population Data from 1960 by Country
pd_pop = pd.read_csv('C:\\Users\\msbar\\Data Engineering Final Project\\data\\Population\\population_total_long.csv')
pd_pop.shape

(12595, 3)

In [64]:
pd_pop.head()

  Country Name  Year    Count
0        Aruba  1960    54211
1  Afghanistan  1960  8996973
2       Angola  1960  5454933
3      Albania  1960  1608800
4      Andorra  1960    13411

In [70]:
pd_pop["Year"].min()

1960

In [65]:
pd_pop['Country Name'].value_counts()

Lesotho                      58
Paraguay                     58
Angola                       58
Rwanda                       58
Fiji                         58
                             ..
Kuwait                       55
Eritrea                      52
West Bank and Gaza           28
Serbia                       28
Sint Maarten (Dutch part)    20
Name: Country Name, Length: 219, dtype: int64

In [66]:
# CO2 Emission data 1751 - 2018 by Country
pd_em = pd.read_csv("C:\\Users\\msbar\\Data Engineering Final Project\\data\\co2_emission.csv")
pd_em.shape
list(pd_em.columns)

['Entity', 'Code', 'Year', 'Annual CO₂ emissions (tonnes )']

In [67]:
pd_em.head()

        Entity Code  Year  Annual CO₂ emissions (tonnes )
0  Afghanistan  AFG  1949                         14656.0
1  Afghanistan  AFG  1950                         84272.0
2  Afghanistan  AFG  1951                         91600.0
3  Afghanistan  AFG  1952                         91600.0
4  Afghanistan  AFG  1953                        106256.0

In [68]:

pd_em[pd_em['Year'] > 1900].groupby(by=["Entity"]).mean().sort_values(by=['Annual CO₂ emissions (tonnes )'], ascending=False)

                                Year  Annual CO₂ emissions (tonnes )
Entity
World                    1959.000000                    1.308054e+10
United States            1959.000000                    3.322341e+09
EU-28                    1959.000000                    2.746021e+09
China                    1959.500000                    1.725314e+09
Russia                   1988.000000                    1.704900e+09
...                              ...                             ...
Saint Helena             1998.184211                    9.113389e+03
Antarctic Fisheries      1997.000000                    7.328000e+03
Niue                     1993.500000                    5.657887e+03
Kyrgysztan               1975.000000                    0.000000e+00
Statistical differences  1959.000000                   -6.592564e+07

[233 rows x 2 columns]

In [69]:
pd_em['Year'].min()

1751